# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

print(f'{int(input()):b}')